<template>

  <div>
    <div style="display: flex; justify-content: center; align-items: center">
      <div style="background: #004948; height: 3px; flex-grow: 3;border-radius: 3px"></div>
      <span style="margin: 10px; font-size: 30px">فرم تعهد نامه</span>
      <div style="background: #004948; height: 3px; flex-grow: 3; border-radius: 3px"></div>
    </div>
    اینجانب تعهد می دهم که:
    شئونات اسلامی و موازین اخلاقی را رعایت نمایم.
    پـروتـــــکـل‌ های بهــــــداشـــــتی را رعـــــــایــــت و در طــــــول رویـــــــداد از ماســــــــک
    استـــــفـــــــاده نمایم.
    با کـــــادر برگـــــــزاری رویداد همــــــکاری لازم را به عمـــــل آورم و نظـــــم و انـــــضــباط را رعــایت
    نمایم.
    راس ساعت مقرر در هـــــــمایش حضور پیدا کرده و در پایـــــــــــــــان ساعـــــــــــــــــــت مقرر خارج شوم.
    در حـــــــــــــفظ تجهیزات دانشگاه کوشش کنم و در صورت وارد کردن هرگونه خسارت، آن را جبران
    نمایم.
    از وســـایل خود مراقـــــــبت نمــــوده و در صــــورت بروز مشـــــکل مســـئولیت آن را بر عهده میـــگیرم.
    کلیه ضــــوابط و شرایطی را که پیـــــش از رویداد و در طــــول رویداد اعـلام می‌شود، رعـایت نمایم و
    در صورت نقض هر یک از این قوانین، مسئولین رویداد با اینجانب برخورد خواهند کرد.
    تمامــــی اطلاعات خواسته شده در مراحـل ثبت نام را به طور دقیق و با صــداقت تکمیــل نمـوده‌ام
    و چـــنانچه هـــر زمـــان عدم صحــــت این اطـــلاعات مشخــص گردد، بدون استرداد وجه پرداختی از
    شرکت در رویداد محروم شوم.

    تذکرات :
    مسئولین رویداد در خارج از ساعـات رویداد و فضای دانشــگاه مسئولیتی در قبال شرکت کنندگان
    ندارند.

    <div style="display: flex; justify-content: space-between; align-items: center">
      <v-checkbox label="شرایط گفته شده را مطالعه نموده و قبول دارم."></v-checkbox>
      <v-btn class="button-fill" style="color: #FEFEFE" @click="goToNextPage">تکمیل ثبت نام</v-btn>
    </div>
  </div>
</template>

<script>
export default {
  name: "UserConfirm",
  methods: {
    goToNextPage() {
      this.$store.commit('register/setState', this.$store.state.register.state + 1)
    }
  }
}
</script>

<style scoped>

</style>
